dockerCompose/sources/servidorNode/test/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Calentamiento"
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: "Carga media"
    - duration: 90
      arrivalRate: 10
      rampTo: 15
      name: "Carga alta"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Prueba de carga - Autenticación"
    weight: 30
    flow:
      # Test de login exitoso
      - post:
          url: "/auth/login"
          json:
            email: "test@example.com"
            contrasena: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: [200, 400, 401]

      # Test de login con credenciales inválidas
      - post:
          url: "/auth/login"
          json:
            email: "invalid@example.com"
            contrasena: "wrongpassword"
          expect:
            - statusCode: [400, 401]

  - name: "Prueba de carga - Gestión de Pacientes"
    weight: 40
    flow:
      # Login para obtener token
      - post:
          url: "/auth/login"
          json:
            email: "medico@test.com"
            contrasena: "password123"
          capture:
            - json: "$.token"
              as: "authToken"

      # Obtener paciente por ID
      - get:
          url: "/paciente/{{ $randomInt(1, 100) }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 404, 500]

      # Buscar pacientes
      - get:
          url: "/pacientes"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 500]